lemmingDev/GP2040-CE/esp32-s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# Use the project partitions.csv (gpconfig partition for persistence).
# Without this, IDF silently builds the default single-app table and the
# gpconfig partition never exists on flash (found on hardware 2026-09-20:
# save()/load() no-op silently with the default table).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Task 8 Ruling R3 (refined vs IDF v5.4 source 2026-09-20): there is NO
# BT_NIMBLE_HID_DEVICE symbol in NimBLE Kconfig — only BT_NIMBLE_HID_SERVICE
# (MyNewt host-side service). But a device-side HID API DOES ship: the esp_hid
# component (components/esp_hid/include/esp_hidd.h, ESP_HID_CLASS_GPD gamepad)
# with NimBLE transport per examples/bluetooth/esp_hid_device. Phase 1 to
# evaluate esp_hidd vs the hand-rolled GATT 0x1812 table in BluetoothDriver.cpp
# before first hardware validation. Leaving HID service at default (n).
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
